app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("created_at", "favorite", "safety", "success", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-24 18:18:44.271079"], ["favorite", "t"], ["safety", "t"], ["success", "t"], ["updated_at", "2014-09-24 18:18:44.271079"], ["user_id", 1]]
---
  def create
    @rating = current_user.ratings.build(rating_params)
    @user = current_user
    respond_to do |format|
      if @rating.save

DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 2]]
---
  def destroy
    @rating.destroy

SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_rating
      @rating = Rating.find(params[:id])