app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-17 15:23:39.677277"], ["name", "Joe Mellin"], ["provider", "facebook"], ["uid", "10103487682752613"], ["updated_at", "2014-09-17 15:23:39.677277"]]
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'facebook' AND "users"."uid" = '10103487682752613'  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)