app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."user_id" = 1 AND "ratings"."success" = 't'
---
  def show
    @user = User.find(params[:id])
    @total = Rating.where('success' => true).count

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def call
    @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def admin
    @users = User.all

UPDATE "users" SET "nick" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["nick", "Joe"], ["phone", "4152598215"], ["updated_at", "2014-09-22 17:40:22.739904"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)